# AllElementsRemovedFromCircuitGroup Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..AllElementsRemovedFromCircuitGroup Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
[System] is empty and will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AllElementsRemovedFromCircuitGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllElementsRemovedFromCircuitGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AllElementsRemovedFromCircuitGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace